# Learning Pandas
Pandas is a Python library for data manipulation and analysis. It is built on top of NumPy and provides powerful tools to work with structured data (like tables in Excel or SQL).

It allows you to:

- Load, clean, and process datasets
- Perform exploratory data analysis (EDA)
- Handle missing data efficiently
- Merge, group, and reshape datasets
- Key Data Structures in Pandas

Series: A one-dimensional array with labels (like a column in a spreadsheet)

DataFrame: A two-dimensional table-like data structure (like a whole spreadsheet).

## Basics

In [ ]:
# installing pandas
%pip install pandas

# "!pip install" also works

In [2]:
# importing
import pandas as pd
print(pd.__version__)

2.2.3

In [3]:
# series data - 1D data structure
data = [10, 20, 30, 40, 50]
series1 = pd.Series(data) # creating series from list
print(series1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

The first Series automatically gets a default index (0, 1, 2, ...)

In [4]:
# custom label in series
series1 = pd.Series(data, index=['a', 'b', 'c', 'd', 'e'])
print(series1)

index = [11, 22, 33, 44, 55]
series1 = pd.Series(data, index=index)
print(series1)

a    10
b    20
c    30
d    40
e    50
dtype: int64
11    10
22    20
33    30
44    40
55    50
dtype: int64

In [5]:
# dataframe - 2D data structure
data = {'Name': ['Anjali', 'Priya', 'Rahul'],
        'Age': [24, 26, 20],
        'Salary':[50000, 60000, 20000]}

df = pd.DataFrame(data) # creating dataframe from dictionary
print(df)

     Name  Age  Salary
0  Anjali   24   50000
1   Priya   26   60000
2   Rahul   20   20000

In [6]:
# series from numpy array
import numpy as np

arr = np.array([1, 2, 3, 4, 5]) # creating numpy array
series = pd.Series(arr) # series data from numpy 1D array

print(arr)
print(series)

[1 2 3 4 5]
0    1
1    2
2    3
3    4
4    5
dtype: int32

## Exploring and Inspecting Data

In [7]:
# how the data looks like
data = {'Name': ['Anjali', 'Priya', 'Rahul'],
        'Age': [24, 26, 20],
        'Salary':[50000, 60000, 20000]}

df = pd.DataFrame(data)
print(df)

     Name  Age  Salary
0  Anjali   24   50000
1   Priya   26   60000
2   Rahul   20   20000

In [8]:
# displaying

print(df) # entire data
print(df.head(2)) # first 2 rows
print(df.tail(2)) # last 2 rows

     Name  Age  Salary
0  Anjali   24   50000
1   Priya   26   60000
2   Rahul   20   20000
     Name  Age  Salary
0  Anjali   24   50000
1   Priya   26   60000
    Name  Age  Salary
1  Priya   26   60000
2  Rahul   20   20000

In [9]:
# shapes and columns

print(df.shape) # gives no. of rows, no. of cols
print(df.columns) # list of column names
print('\n')
print(df.dtypes) # data types in each col

(3, 3)
Index(['Name', 'Age', 'Salary'], dtype='object')


Name      object
Age        int64
Salary     int64
dtype: object

In [10]:
# statistics

print(df.describe()) # descriptive statistics for numeric cols
# note that describe and describe() is different

print(df.describe(include='all')) # descriptive statistics for all cols)

             Age        Salary
count   3.000000      3.000000
mean   23.333333  43333.333333
std     3.055050  20816.659995
min    20.000000  20000.000000
25%    22.000000  35000.000000
50%    24.000000  50000.000000
75%    25.000000  55000.000000
max    26.000000  60000.000000
          Name        Age        Salary
count        3   3.000000      3.000000
unique       3        NaN           NaN
top     Anjali        NaN           NaN
freq         1        NaN           NaN
mean       NaN  23.333333  43333.333333
std        NaN   3.055050  20816.659995
min        NaN  20.000000  20000.000000
25%        NaN  22.000000  35000.000000
50%        NaN  24.000000  50000.000000
75%        NaN  25.000000  55000.000000
max        NaN  26.000000  60000.000000

In [11]:
# missing values

data = {'Name': ['Anjali', None, 'Rahul'],
        'Age': [24, 26, 20],
        'Salary':[50000, 60000, None]}

df = pd.DataFrame(data)
print(df)

print(df.isnull()) # checks for missing values
print(df.isnull().sum()) # counts missing values in each col

     Name  Age   Salary
0  Anjali   24  50000.0
1    None   26  60000.0
2   Rahul   20      NaN
    Name    Age  Salary
0  False  False   False
1   True  False   False
2  False  False    True
Name      1
Age       0
Salary    1
dtype: int64

## Selecting and Accessing

In [12]:
print(df['Age']) # accessing Age col

0    24
1    26
2    20
Name: Age, dtype: int64

In [13]:
print(df.Age) # dot notation works when col name is simple

0    24
1    26
2    20
Name: Age, dtype: int64

In [14]:
print(df[['Name', 'Salary']]) # accessing multiple cols

cols = ['Age', 'Name']
print(df[cols]) # using the list to access cols

     Name   Salary
0  Anjali  50000.0
1    None  60000.0
2   Rahul      NaN
   Age    Name
0   24  Anjali
1   26    None
2   20   Rahul

In [15]:
print(df) # checking the DataFrame once

     Name  Age   Salary
0  Anjali   24  50000.0
1    None   26  60000.0
2   Rahul   20      NaN

In [16]:
# selecting rows

print(df.iloc[0]) # first row by position
# iloc used for integer based indexing

print(df.loc[2]) # first row by label
# loc used for label based indexing

Name       Anjali
Age            24
Salary    50000.0
Name: 0, dtype: object
Name      Rahul
Age          20
Salary      NaN
Name: 2, dtype: object

In [17]:
data = {'Name': ['Anjali', None, 'Rahul'],
        'Age': [24, 26, 20],
        'Salary':[50000, 60000, None]}

df = pd.DataFrame(data, index=['a', 'b', 'c']) # keeping labels
print(df)

     Name  Age   Salary
a  Anjali   24  50000.0
b    None   26  60000.0
c   Rahul   20      NaN

In [18]:
# selecting rows again

print(df.iloc[1]) # row by position, 1 selects 2nd row

# print(df.loc[1]) # gives error

print(df.loc['c']) # label based indexing

Name         None
Age            26
Salary    60000.0
Name: b, dtype: object
Name      Rahul
Age          20
Salary      NaN
Name: c, dtype: object

Use `.iloc[]` for integer-based indexing

Use `.loc[]` for label-based indexing

In [19]:
# slicing rows and cols

print(df.iloc[:2, : ]) # first two rows and all cols

print(df.loc['a':'c', ['Name', 'Salary']]) # label based slicing and selecting specific cols

     Name  Age   Salary
a  Anjali   24  50000.0
b    None   26  60000.0
     Name   Salary
a  Anjali  50000.0
b    None  60000.0
c   Rahul      NaN

## Filtering, Sorting and Modifying Data

In [20]:
data = {'Name': ['Anjali', 'Bubbles', 'Rahul', 'Priya', 'Newton'],
        'Age': [24, 26, 20, 27, 38],
        'Salary':[50000, 60000, 20000, 23000, 44000]}

df = pd.DataFrame(data) # making sample dataframe
print(df)

      Name  Age  Salary
0   Anjali   24   50000
1  Bubbles   26   60000
2    Rahul   20   20000
3    Priya   27   23000
4   Newton   38   44000

In [21]:
# filtering

filtered_df = df[df["Age"] > 25] # selecting rows where age>25
print(filtered_df)

      Name  Age  Salary
1  Bubbles   26   60000
3    Priya   27   23000
4   Newton   38   44000

In [22]:
# using & (AND) and | (OR)

filtered_df  = df[(df['Age'] > 25) & (df['Salary'] <45000)] # using the AND operator
print(filtered_df)

filtered_df  = df[(df['Age'] > 25) | (df['Age'] < 22)] # using the AND operator
print(filtered_df)

     Name  Age  Salary
3   Priya   27   23000
4  Newton   38   44000
      Name  Age  Salary
1  Bubbles   26   60000
2    Rahul   20   20000
3    Priya   27   23000
4   Newton   38   44000

In [23]:
# sorting data

sorted_df = df.sort_values('Age') # sorting according to Age col
print(sorted_df)

# descending order of sort using ascending = False parameter

sorted_df = df.sort_values('Name', ascending=False) # sorting according to Name col
print(sorted_df)

sorted_df = df.sort_values(['Age', 'Name'], ascending=[True, False])
print(sorted_df)

      Name  Age  Salary
2    Rahul   20   20000
0   Anjali   24   50000
1  Bubbles   26   60000
3    Priya   27   23000
4   Newton   38   44000
      Name  Age  Salary
2    Rahul   20   20000
3    Priya   27   23000
4   Newton   38   44000
1  Bubbles   26   60000
0   Anjali   24   50000
      Name  Age  Salary
2    Rahul   20   20000
0   Anjali   24   50000
1  Bubbles   26   60000
3    Priya   27   23000
4   Newton   38   44000

In [24]:
# renaming cols

print(df)
df_renamed = df.rename(columns={"Name": "Employee Name", 'Salary': 'Annual Salary'})
print(df_renamed)

      Name  Age  Salary
0   Anjali   24   50000
1  Bubbles   26   60000
2    Rahul   20   20000
3    Priya   27   23000
4   Newton   38   44000
  Employee Name  Age  Annual Salary
0        Anjali   24          50000
1       Bubbles   26          60000
2         Rahul   20          20000
3         Priya   27          23000
4        Newton   38          44000

In [25]:
# adding a new col

data = {'Name': ['Anjali', 'Bubbles', 'Rahul', 'Priya', 'Newton'],
        'Age': [24, 26, 20, 27, 38],
        'Salary':[50000, 60000, 20000, 23000, 44000]}

df = pd.DataFrame(data) # making sample dataframe
print(df)

df['Bonus'] = df['Salary'] * 0.01 # making new col Bonus as 1% of Salary col
df['Net Salary'] = df['Salary'] + df['Bonus'] # making new col based on previous cols

print(df)

      Name  Age  Salary
0   Anjali   24   50000
1  Bubbles   26   60000
2    Rahul   20   20000
3    Priya   27   23000
4   Newton   38   44000
      Name  Age  Salary  Bonus  Net Salary
0   Anjali   24   50000  500.0     50500.0
1  Bubbles   26   60000  600.0     60600.0
2    Rahul   20   20000  200.0     20200.0
3    Priya   27   23000  230.0     23230.0
4   Newton   38   44000  440.0     44440.0

In [26]:
# modifying existing cols

df['Salary'] = df['Salary'] + 10000 # increasing salary by 10000
print(df)

# updating bonus and net salary

df['Bonus'] = df['Salary'] * 0.01 # making new col Bonus as 1% of Salary col
df['Net Salary'] = df['Salary'] + df['Bonus'] # making new col based on previous cols

print(df)

      Name  Age  Salary  Bonus  Net Salary
0   Anjali   24   60000  500.0     50500.0
1  Bubbles   26   70000  600.0     60600.0
2    Rahul   20   30000  200.0     20200.0
3    Priya   27   33000  230.0     23230.0
4   Newton   38   54000  440.0     44440.0
      Name  Age  Salary  Bonus  Net Salary
0   Anjali   24   60000  600.0     60600.0
1  Bubbles   26   70000  700.0     70700.0
2    Rahul   20   30000  300.0     30300.0
3    Priya   27   33000  330.0     33330.0
4   Newton   38   54000  540.0     54540.0

In [27]:
# dropping rows or cols
print(df)

      Name  Age  Salary  Bonus  Net Salary
0   Anjali   24   60000  600.0     60600.0
1  Bubbles   26   70000  700.0     70700.0
2    Rahul   20   30000  300.0     30300.0
3    Priya   27   33000  330.0     33330.0
4   Newton   38   54000  540.0     54540.0

In [28]:
# drop col
df_dropped = df.drop(columns=['Bonus'])
print(df)
print(df_dropped)

      Name  Age  Salary  Bonus  Net Salary
0   Anjali   24   60000  600.0     60600.0
1  Bubbles   26   70000  700.0     70700.0
2    Rahul   20   30000  300.0     30300.0
3    Priya   27   33000  330.0     33330.0
4   Newton   38   54000  540.0     54540.0
      Name  Age  Salary  Net Salary
0   Anjali   24   60000     60600.0
1  Bubbles   26   70000     70700.0
2    Rahul   20   30000     30300.0
3    Priya   27   33000     33330.0
4   Newton   38   54000     54540.0

In [29]:
# drop row by index
df_dropped = df.drop(index=1)
print(df)
print(df_dropped)

      Name  Age  Salary  Bonus  Net Salary
0   Anjali   24   60000  600.0     60600.0
1  Bubbles   26   70000  700.0     70700.0
2    Rahul   20   30000  300.0     30300.0
3    Priya   27   33000  330.0     33330.0
4   Newton   38   54000  540.0     54540.0
     Name  Age  Salary  Bonus  Net Salary
0  Anjali   24   60000  600.0     60600.0
2   Rahul   20   30000  300.0     30300.0
3   Priya   27   33000  330.0     33330.0
4  Newton   38   54000  540.0     54540.0

In [30]:
# reinitializing

data = {'Name': ['Anjali', 'Bubbles', 'Rahul', 'Priya', 'Newton'],
        'Age': [24, 26, 20, 27, 38],
        'Salary':[50000, 60000, 20000, 23000, 44000]}

df = pd.DataFrame(data) # making sample dataframe
print(df)

df['Bonus'] = df['Salary'] * 0.01 # making new col Bonus as 1% of Salary col
df['Net Salary'] = df['Salary'] + df['Bonus'] # making new col based on previous cols

print(df)

      Name  Age  Salary
0   Anjali   24   50000
1  Bubbles   26   60000
2    Rahul   20   20000
3    Priya   27   23000
4   Newton   38   44000
      Name  Age  Salary  Bonus  Net Salary
0   Anjali   24   50000  500.0     50500.0
1  Bubbles   26   60000  600.0     60600.0
2    Rahul   20   20000  200.0     20200.0
3    Priya   27   23000  230.0     23230.0
4   Newton   38   44000  440.0     44440.0

In [31]:
# setting Name as index
df_indexed = df.set_index('Name')
print(df_indexed)

         Age  Salary  Bonus  Net Salary
Name
Anjali    24   50000  500.0     50500.0
Bubbles   26   60000  600.0     60600.0
Rahul     20   20000  200.0     20200.0
Priya     27   23000  230.0     23230.0
Newton    38   44000  440.0     44440.0

In [32]:
# resetting the index

df_reset = df_indexed.reset_index(drop=False) # keep Name as col
print(df_reset)

      Name  Age  Salary  Bonus  Net Salary
0   Anjali   24   50000  500.0     50500.0
1  Bubbles   26   60000  600.0     60600.0
2    Rahul   20   20000  200.0     20200.0
3    Priya   27   23000  230.0     23230.0
4   Newton   38   44000  440.0     44440.0

In [33]:
# resetting the index

df_reset = df_indexed.reset_index(drop=True) # drop Name as col
print(df_reset)

   Age  Salary  Bonus  Net Salary
0   24   50000  500.0     50500.0
1   26   60000  600.0     60600.0
2   20   20000  200.0     20200.0
3   27   23000  230.0     23230.0
4   38   44000  440.0     44440.0

## CSV

In [34]:
# pandas.read_csv(filepath_or_buffer, sep=',', header='infer', names=None, index_col=None, usecols=None, dtype=None, engine='python', encoding=None, ... )

In [35]:
# reading from csv file

df = pd.read_csv('employee_data.csv')
print(df.head()) # printing first 5 rows

  Employee ID           Name Department  Age  Salary Joining Date  \
0      E00001  Daniel Miller  Marketing   37  120145   2021-08-19
1      E00002  Robert Taylor      Sales   39   37839   2015-02-06
2      E00003      Jose Lane    Finance   22  121732   2022-06-10
3      E00004  William Watts      Sales   22   68457   2018-08-16
4      E00005     Tracy Ward      Sales   22  146584   2024-02-22

   Performance Score
0                  7
1                  2
2                  3
3                  2
4                  5

In [36]:
# DataFrame.to_csv(path_or_buffer, sep=',', index=True, header=True, mode='w', encoding=None, compression=None, ... )

In [37]:
# writing to csv file

df.to_csv('copy_employee_data.csv', index=False) # do not include row indices

In [38]:
# skip rows

df = pd.read_csv('employee_data.csv', skiprows=10000)
print(df.head())

   E10000      William Blake    Finance  27  131484  2016-03-17  1
0  E10001  Michael Maldonado         IT  58  106088  2015-10-11  4
1  E10002   Samantha Hoffman  Marketing  43   70584  2017-08-27  2
2  E10003        Heather Lee      Sales  28   80296  2022-01-07  5
3  E10004       Sarah Nelson  Marketing  51   46482  2015-04-15  4
4  E10005     Steven Sanders  Marketing  31  148337  2015-12-20  1

In [39]:
# reading in chunks for large files

chunks = pd.read_csv('employee_data.csv', chunksize= 1000) # 1000 rows at a time
for chunk in chunks:
    print(chunk.head(), '\n')

  Employee ID           Name Department  Age  Salary Joining Date  \
0      E00001  Daniel Miller  Marketing   37  120145   2021-08-19
1      E00002  Robert Taylor      Sales   39   37839   2015-02-06
2      E00003      Jose Lane    Finance   22  121732   2022-06-10
3      E00004  William Watts      Sales   22   68457   2018-08-16
4      E00005     Tracy Ward      Sales   22  146584   2024-02-22

   Performance Score
0                  7
1                  2
2                  3
3                  2
4                  5

     Employee ID            Name Department  Age  Salary Joining Date  \
1000      E01001   Sarah Gregory  Marketing   47  129754   2023-09-14
1001      E01002  Stephen Warren  Marketing   32   87566   2023-09-22
1002      E01003     Wendy Weeks  Marketing   39   70692   2015-12-25
1003      E01004     Lisa Fields  Marketing   26  144358   2016-04-21
1004      E01005   Ryan Thompson      Sales   37   53442   2021-09-19

      Performance Score
1000                  3
1001                  1
1002                  7
1003                  8
1004                  6

     Employee ID                Name Department  Age  Salary Joining Date  \
2000      E02001       Jason Collier  Marketing   51   55547   2015-08-24
2001      E02002      Rachel Chapman    Finance   38   89734   2020-11-13
2002      E02003       Taylor Murphy         IT   30  141579   2019-11-07
2003      E02004  Jeremiah Fernandez         HR   49  103360   2024-05-27
2004      E02005         James White      Sales   28   35455   2024-06-25

      Performance Score
2000                  8
2001                  8
2002                  9
2003                  5
2004                  9

     Employee ID                 Name Department  Age  Salary Joining Date  \
3000      E03001     Danielle Watkins    Finance   34   73064   2016-01-09
3001      E03002      Samantha Taylor      Sales   52  136735   2017-10-03
3002      E03003  Jacqueline Gonzales         HR   34   52954   2017-04-07
3003      E03004          David Wells      Sales   39  126872   2024-09-22
3004      E03005            Gina Cruz         IT   58  139120   2015-07-20

      Performance Score
3000                  8
3001                  3
3002                  5
3003                  6
3004                  7

     Employee ID                Name Department  Age  Salary Joining Date  \
4000      E04001         Marcus Ward    Finance   56   46852   2019-01-20
4001      E04002  Christine Martinez      Sales   45   47013   2024-02-23
4002      E04003    Robert Mcconnell         IT   34  115302   2018-03-02
4003      E04004        Alicia Smith      Sales   54   36538   2017-08-12
4004      E04005        Meghan Kelly         IT   36  128417   2018-01-24

      Performance Score
4000                 10
4001                 10
4002                  6
4003                  4
4004                  4

     Employee ID                 Name Department  Age  Salary Joining Date  \
5000      E05001      Denise Randolph         IT   33  100373   2015-10-13
5001      E05002      Joseph Hatfield      Sales   46   69101   2021-03-25
5002      E05003        Rhonda Reeves  Marketing   31  123884   2020-06-08
5003      E05004   Margaret Singleton  Marketing   43   85463   2023-10-25
5004      E05005  Christopher Perkins      Sales   28   78734   2023-02-19

      Performance Score
5000                  6
5001                  7
5002                  8
5003                  8
5004                  9

     Employee ID              Name Department  Age  Salary Joining Date  \
6000      E06001     Andrew Graham         HR   50  130234   2024-02-08
6001      E06002   Samantha Campos  Marketing   29   57692   2022-10-29
6002      E06003      Angela Boyle         IT   38   77049   2023-10-15
6003      E06004  Mallory Martinez    Finance   28  112542   2016-03-02
6004      E06005    Caitlin Haynes         IT   33   48721   2021-03-21

      Performance Score
6000                  4
6001                  7
6002                  1
6003                  9
6004                  5

     Employee ID             Name Department  Age  Salary Joining Date  \
7000      E07001     Joseph Jones      Sales   39   60588   2020-06-18
7001      E07002     Johnny Davis         IT   33   98453   2023-11-16
7002      E07003   Ashley Mcclure      Sales   37   57115   2018-03-26
7003      E07004     Kelly Bryant         HR   48   34353   2023-12-31
7004      E07005  Abigail Wallace         IT   57  106162   2021-09-20

      Performance Score
7000                  8
7001                  9
7002                  9
7003                  9
7004                  2

     Employee ID              Name Department  Age  Salary Joining Date  \
8000      E08001    Michael Dillon         HR   59   80702   2022-02-18
8001      E08002  Jonathan Roberts      Sales   23   85823   2018-09-21
8002      E08003      Rebecca Hess      Sales   38  113253   2022-02-27
8003      E08004      Anna Carroll      Sales   47   93102   2019-05-10
8004      E08005   Nicholas Nelson      Sales   59  128058   2024-06-02

      Performance Score
8000                  4
8001                  1
8002                 10
8003                  5
8004                  7

     Employee ID              Name Department  Age  Salary Joining Date  \
9000      E09001       Michael Lee    Finance   47  108004   2024-12-01
9001      E09002      Emily Bryant         IT   34   91849   2020-10-14
9002      E09003  Stephanie Curtis    Finance   43  110387   2023-07-13
9003      E09004    Jonathan Smith         IT   44   43199   2020-04-15
9004      E09005     David Edwards      Sales   54  127115   2024-05-14

      Performance Score
9000                  7
9001                  1
9002                 10
9003                  1
9004                  7

      Employee ID               Name Department  Age  Salary Joining Date  \
10000      E10001  Michael Maldonado         IT   58  106088   2015-10-11
10001      E10002   Samantha Hoffman  Marketing   43   70584   2017-08-27
10002      E10003        Heather Lee      Sales   28   80296   2022-01-07
10003      E10004       Sarah Nelson  Marketing   51   46482   2015-04-15
10004      E10005     Steven Sanders  Marketing   31  148337   2015-12-20

       Performance Score
10000                  4
10001                  2
10002                  5
10003                  4
10004                  1

      Employee ID              Name Department  Age  Salary Joining Date  \
11000      E11001   Ashley Williams  Marketing   26   56610   2023-07-20
11001      E11002  Steve Cunningham         IT   24   66981   2021-05-05
11002      E11003    Patricia Wolfe  Marketing   58   59309   2015-08-22
11003      E11004      Emily Parker    Finance   27   89388   2021-10-31
11004      E11005     Anthony Adams      Sales   37  128166   2022-10-08

       Performance Score
11000                  9
11001                  6
11002                  2
11003                  2
11004                 10

      Employee ID              Name Department  Age  Salary Joining Date  \
12000      E12001  Zachary Thompson  Marketing   28   68405   2018-08-06
12001      E12002    Nicole Gardner         HR   58   65971   2016-08-15
12002      E12003     Jason Mcclure  Marketing   58  105528   2015-11-06
12003      E12004       Joseph Wood      Sales   28   90740   2020-09-09
12004      E12005      Patrick Hull    Finance   43  135539   2018-08-17

       Performance Score
12000                  7
12001                 10
12002                  2
12003                  8
12004                  6

      Employee ID              Name Department  Age  Salary Joining Date  \
13000      E13001    Ashlee Sanchez      Sales   40  109665   2016-03-24
13001      E13002      Kristy Hurst  Marketing   46   64832   2022-03-13
13002      E13003    Katie Wyatt MD         HR   56   81503   2017-03-28
13003      E13004      Natasha Barr         HR   33   44200   2024-06-09
13004      E13005  Michelle Johnson  Marketing   47   56113   2022-12-15

       Performance Score
13000                  1
13001                  4
13002                  1
13003                  4
13004                  1

      Employee ID             Name Department  Age  Salary Joining Date  \
14000      E14001      Sherry Hart         HR   47   77467   2017-01-22
14001      E14002  Jessica Manning  Marketing   50  128041   2020-10-14
14002      E14003       James Bush      Sales   26   41411   2024-08-04
14003      E14004     Kelly Martin         IT   53  139109   2020-07-08
14004      E14005       Seth Jones    Finance   59   92408   2016-04-22

       Performance Score
14000                  3
14001                  7
14002                  3
14003                  9
14004                 10

      Employee ID                Name Department  Age  Salary Joining Date  \
15000      E15001     Jennifer Jordan      Sales   53  129549   2018-12-18
15001      E15002  Christopher Morgan         HR   42  130541   2016-12-04
15002      E15003     Sarah Rodriguez  Marketing   51  147307   2021-11-27
15003      E15004           Brad Diaz  Marketing   45   54780   2017-04-29
15004      E15005        James Mathis      Sales   35   89603   2021-07-04

       Performance Score
15000                 10
15001                  4
15002                  4
15003                  7
15004                  4

      Employee ID           Name Department  Age  Salary Joining Date  \
16000      E16001    Andrea Nash    Finance   59   75053   2016-10-15
16001      E16002    Penny Perry  Marketing   34   78984   2022-06-09
16002      E16003    Glen Chavez    Finance   47  109028   2017-04-20
16003      E16004  Michelle Leon         IT   32   37632   2015-10-02
16004      E16005  Michael Clark         HR   45   45387   2023-07-18

       Performance Score
16000                  5
16001                 10
16002                  3
16003                  3
16004                  3

      Employee ID          Name Department  Age  Salary Joining Date  \
17000      E17001   Jamie Ochoa         HR   27   72472   2016-12-06
17001      E17002  John Aguirre         HR   36  110832   2022-10-24
17002      E17003  Sarah Larson    Finance   56   32283   2024-03-01
17003      E17004   Traci Blake         HR   47  135856   2017-08-04
17004      E17005   Amanda Yang      Sales   48   61080   2022-08-30

       Performance Score
17000                  4
17001                  6
17002                  1
17003                  4
17004                  5

      Employee ID              Name Department  Age  Salary Joining Date  \
18000      E18001  Michael Anderson    Finance   39   31307   2018-06-12
18001      E18002     Travis Butler         HR   24  105922   2021-05-18
18002      E18003     Danielle King      Sales   34   51943   2021-09-16
18003      E18004       Frank Moore         IT   34  107203   2022-08-03
18004      E18005     Donald Morgan      Sales   50  116726   2016-07-31

       Performance Score
18000                  4
18001                  1
18002                  8
18003                  8
18004                  5

      Employee ID             Name Department  Age  Salary Joining Date  \
19000      E19001    Charles Jones    Finance   48  141182   2024-09-02
19001      E19002   Priscilla Hart      Sales   49  149664   2018-02-15
19002      E19003     Daniel Wolfe      Sales   37   44432   2024-02-21
19003      E19004    Jimmy Wheeler         HR   30   89895   2023-07-28
19004      E19005  Lauren Chambers      Sales   36   58014   2024-04-25

       Performance Score
19000                  7
19001                  9
19002                  8
19003                  3
19004                  8

In [40]:
# read only specific cols

df = pd.read_csv('employee_data.csv', usecols = ['Name', 'Salary']) # reading only Name and Salary cols
print(df.head())

            Name  Salary
0  Daniel Miller  120145
1  Robert Taylor   37839
2      Jose Lane  121732
3  William Watts   68457
4     Tracy Ward  146584

# Using Kaggle Dataset and Doing Things

In [51]:
# using the downloaded dataset from kaggle

dataset = pd.read_csv('netflix_titles.csv')
print(dataset.head())

  show_id     type                  title         director  \
0      s1    Movie   Dick Johnson Is Dead  Kirsten Johnson
1      s2  TV Show          Blood & Water              NaN
2      s3  TV Show              Ganglands  Julien Leclercq
3      s4  TV Show  Jailbirds New Orleans              NaN
4      s5  TV Show           Kota Factory              NaN

                                                cast        country  \
0                                                NaN  United States
1  Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...   South Africa
2  Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...            NaN
3                                                NaN            NaN
4  Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...          India

           date_added  release_year rating   duration  \
0  September 25, 2021          2020  PG-13     90 min
1  September 24, 2021          2021  TV-MA  2 Seasons
2  September 24, 2021          2021  TV-MA   1 Season
3  September 24, 2021          2021  TV-MA   1 Season
4  September 24, 2021          2021  TV-MA  2 Seasons

                                           listed_in  \
0                                      Documentaries
1    International TV Shows, TV Dramas, TV Mysteries
2  Crime TV Shows, International TV Shows, TV Act...
3                             Docuseries, Reality TV
4  International TV Shows, Romantic TV Shows, TV ...

                                         description
0  As her father nears the end of his life, filmm...
1  After crossing paths at a party, a Cape Town t...
2  To protect his family from a powerful drug lor...
3  Feuds, flirtations and toilet talk go down amo...
4  In a city of coaching centers known to train I...

In [55]:
print(dataset.columns) # checking cols
print(dataset.dtypes) # checking data types

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')
show_id         object
type            object
title           object
director        object
cast            object
country         object
date_added      object
release_year     int64
rating          object
duration        object
listed_in       object
description     object
dtype: object

In [60]:
# check missing values

print(dataset.isnull())

      show_id   type  title  director   cast  country  date_added  \
0       False  False  False     False   True    False       False
1       False  False  False      True  False    False       False
2       False  False  False     False  False     True       False
3       False  False  False      True   True     True       False
4       False  False  False      True  False    False       False
...       ...    ...    ...       ...    ...      ...         ...
8802    False  False  False     False  False    False       False
8803    False  False  False      True   True     True       False
8804    False  False  False     False  False    False       False
8805    False  False  False     False  False    False       False
8806    False  False  False     False  False    False       False

      release_year  rating  duration  listed_in  description
0            False   False     False      False        False
1            False   False     False      False        False
2            False   False     False      False        False
3            False   False     False      False        False
4            False   False     False      False        False
...            ...     ...       ...        ...          ...
8802         False   False     False      False        False
8803         False   False     False      False        False
8804         False   False     False      False        False
8805         False   False     False      False        False
8806         False   False     False      False        False

[8807 rows x 12 columns]

In [61]:
missing_values = dataset.isnull().sum() # sum of missing values
print(missing_values)

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64